In [2]:
count = 0
while count<3:
    print('count=',count)
    count =count+1

count= 0
count= 1
count= 2

In [11]:
data = [2,1,3,4,5,6,3,20]
for [i,k] in enumerate(data):
    print([k])

[2]
[1]
[3]
[4]
[5]
[6]
[3]
[20]

In [13]:
type(k)

int

In [16]:
!conda activate tf2

In [18]:
!conda env list

# conda environments:
#
base                  *  C:\Users\kong_\anaconda3
tf2                      C:\Users\kong_\anaconda3\envs\tf2

In [1]:
import pandas as pd
import numpy as np

In [2]:
datas = [15,12.5, 18,22,17]
idx = ['ksb', 'ninan', 'Tim', 'Jan', 'maw']
ps = pd.Series(datas, index=idx)
ps

ksb      15.0
ninan    12.5
Tim      18.0
Jan      22.0
maw      17.0
dtype: float64

In [10]:
datas = [15,12.5, 18,22,17]
idx = ['ksb', 'ninan', 'Tim', 'Jan', 'maw']
ps = pd.Series(np.array(datas), index=idx)
ps

ksb      15.0
ninan    12.5
Tim      18.0
Jan      22.0
maw      17.0
dtype: float64

In [12]:
datas = [25, 22, 25, 35, 32]
df =pd.DataFrame(datas)
df

    0
0  25
1  22
2  25
3  35
4  32

In [15]:
datas = [25, 22, 25, 35, 32]
cols = ['Age']

df =pd.DataFrame(datas, columns=cols)
df

   Age
0   25
1   22
2   25
3   35
4   32

In [16]:
datas = [[163, 37, 1],
         [175, 20, 0],
         [162, 27, 0],
         [150, 10, 1]]
cols = ['High', 'hair_length', 'voice_pitch']
df = pd.DataFrame(datas, columns=cols)
df

   High  hair_length  voice_pitch
0   163           37            1
1   175           20            0
2   162           27            0
3   150           10            1

In [17]:
lst1 = [15,22,30,24]
lst2 = [20,18,38,19]
datas = list(zip(lst1,lst2))
cols = ['Age', 'Score']
df = pd.DataFrame(datas, columns=cols)
df

   Age  Score
0   15     20
1   22     18
2   30     38
3   24     19

In [18]:
datas =[['Kobkiat',25,35],['Ninan',22,26],
        ['John',25,32],['Tim',35,29],['Steal',32,27]]
cols =['Name', 'Age', 'Score']
df = pd.DataFrame(datas, columns=cols)
df

      Name  Age  Score
0  Kobkiat   25     35
1    Ninan   22     26
2     John   25     32
3      Tim   35     29
4    Steal   32     27

In [19]:
df.set_index('Name', inplace=True)
df

         Age  Score
Name
Kobkiat   25     35
Ninan     22     26
John      25     32
Tim       35     29
Steal     32     27

In [20]:
df.shape

(5, 2)

In [23]:
df

         Age  Score
Name
Kobkiat   25     35
Ninan     22     26
John      25     32
Tim       35     29
Steal     32     27